# Каждый игрок управляет кораблем, который находится в
# середине нижнего края экрана. Игрок перемещает корабль
# вправо и влево с помощью клавиш управления курсором;
# клавиша Пробел используется для стрельбы. В начале игры
# флот пришельцев находится в верхней части экрана и
# постепенно опускается, при этом смещаясь в сторону.
# Игрок уничтожает пришельцев, стреляя по ним. Если ему
# удается сбить всех пришельцев, то появляется новый флот,
# который движется быстрее предыдущего. Если пришелец
# сталкивается с кораблем игрока или доходит до нижнего края
# экрана, то игрок теряет корабль. Если игрок теряет все три
# корабля, то игра заканчивается.
# 
# На первой фазе разработки мы создадим корабль, который
# может двигаться вправо и влево. Корабль должен стрелять
# из пушки, когда игрок нажимает клавишу Пробел. Когда это
# поведение будет реализовано, мы можем заняться пришельцами
# и доработкой игрового процесса.